document.addEventListener("click",(event)=>{
	if(event.target.classList.contains("buttons_link_russ")){

		myFuncRuss();
	}
	if(event.target.classList.contains("buttons_link_kaz")){

		myFuncKazz();
	}

})



function myFuncRuss(event){

	// header
	getItems("about_as_trasiteons").innerHTML ="О&nbsp;нас "
	getItems("gos_trasiteons").innerHTML = "Государственные услуги"
	getItems("about_pay_trasiteons").innerHTML = "Государственные закупки"
	getItems("news_trasiteons").innerHTML = "Новости"

	// logo center title
	
	getItems("logo_center_title").innerHTML = "ДЕТСКИЙ САДИК БАЛДАУРЕН"


	getItems("footer_contact_about").innerHTML = "О&nbsp;нас "
	getItems("footer_contact_about-text").innerHTML = "Наш детский сад — это островок детства; где интересные и увлекательные занятия, которые проводят с детьми наши воспитатели; это праздники, развлечения, проекты… и многое — многое другое."

	// footer	
	getItems("footer_about_as").innerHTML ="О&nbsp;нас "
	getItems("footer_gos_trasiteons").innerHTML = "Государственные услуги"
	getItems("footer_gos_pay").innerHTML = "Государственные закупки"
	getItems("footer_news").innerHTML = "Новости"

	getItems("footer_contact_tell").innerHTML = "контакты"



	// about_as	


	//goZakaz
	 
	getItems("gos_zakas_site").innerHTML = "ГОСУДАРСТВЕННЫЕ УСЛУГИ"
	getItems("gos_title_1").innerHTML = "В городе Петропавловск на портале «INDIGO: электронный детский сад» для государственных детских садов запущен модуль «Электронных договоров». Договор заключают только после получения направления на зачисление и является частью процесса оказания государственной услуги по зачислению в дошкольную организацию. Для заключения электронного договора родителям необходимо иметь ЭЦП и следовать следующему алгоритму:"

	getItems("gos_title_2").innerHTML = "ОЧЕНЬ ВАЖНО:"
	getItems("gos_title_3").innerHTML = "ЭЦП — главный инструмент для подписания электронных договоров. Получить ЭЦП можно в ЦОН или дистанционно из дома через портал egov.kz. Позаботьтесь о получении ЭЦП заранее. Особенно касается тех родителей, которые впервые будут использовать ЭЦП. Срок действия ЭЦП по умолчанию 1 год. В дальнейшем срок действия можно продлить через egov.kz."

	getItems("gos_title_4").innerHTML = "обратите внимание!"
	getItems("gos_title_5").innerHTML = "Обычно после выдачи новой ЭЦП дата начала ее действия прописывается внутри самой ЭЦП и устанавливается на следующий день. Поэтому еще раз: подобные операции нужно делать заранее. и наконец еще раз! Никогда и никому не передавайте учетные данные от личного кабинета. ЭЦП — это очень серьезно. И уж тем более никто и никогда не имеет права требовать вашу ЭЦП при зачислении в детский сад. Банковский счет необходим для проведения безналичных финансовых операций с детским садом. И не только платежи в сторону детского сада. Но и обратно. Есть немало случаев, когда детский сад перечисляет деньги родителю, особенно в ходе взаиморасчетов. У кого нет банковского счета — потребуется открыть. Без него договор подписан не будет. Отнеситесь ответственно к выбору фотографии. Не нужно делать ее как на паспорт — с грустным и серым лицом. Но и не надо прикладывать фотографию со всеми друзьями, родственниками и игрушками. Красивый, умытый, одетый ребенок — лицо и плечи крупным планом. Улыбка обязательна! пожалуйста, отнеситесь серьезно к заполнению всех реквизитов договора. Это юридический документ, и детский сад имеет полное право отказать вам, если заполненная информация некорректная или не соответствует установленным требованиям. Вы можете потерять место и попадете в стоп-лист."


	getItems("gos_list_1").innerHTML = "Зайти в личный кабинет INDIGO, нажать на кнопку «Заключить договор» в разделе «Мои направления» (После нажатия кнопки система запустит специальный процесс и будет по шагово вести родителя, собирая нужную информацию).";

	getItems("gos_list_2").innerHTML = "Ввести Ваши реквизиты в разделе «Заключить договор»."
	getItems("gos_list_3").innerHTML = "Необходимо ознакомиться с определением Договора и реестром нужных документов для его заключения и перейти на следующий шаг"
	getItems("gos_list_4").innerHTML = "На 2-ом шаге Вам необходимо прикрепить ЭЦП и указать его пароль."
	getItems("gos_list_5").innerHTML = "Если в разделе Договоры — Мои реквизиты Вы заполнили все данные, то на данном шаге №3 все эти данные автоматически подтягиваются. В случае если данные не были заполнены, то необходимо вести реквизиты"
	getItems("gos_list_6").innerHTML = "На 4-ом шаге необходимо удостовериться в правильности реквизитов"
	getItems("gos_list_7").innerHTML = "На 5-ом шаге необходимо прикрепить фото ребенка и необходимые документы (прикрепляемый документ не должен превышать размера больше 1 Мб.)"
	getItems("gos_list_8").innerHTML = "На 6-ом шаге необходимо прикрепить ЭЦП для подписания договора, предварительно ознакомившись с ним."

}

function myFuncKazz(event){

	// header
	getItems("about_as_trasiteons").innerHTML = "біз туралы"
	getItems("gos_trasiteons").innerHTML = "Мемлекеттік қызметтер"
	getItems("about_pay_trasiteons").innerHTML = "Мемлекеттік сатып алу"
	getItems("news_trasiteons").innerHTML = "Жаңалықтар";

	// logo center title
	getItems("logo_center_title").innerHTML = "БАЛДӘУРЕН БАЛАБАҚШАСЫ"
	getItems("footer_contact_about").innerHTML = "біз туралы"
	getItems("footer_contact_about-text").innerHTML = "Біздің балабақша-бұл балалық шақтың аралы; мұнда біздің тәрбиешілер балалармен өткізетін қызықты және қызықты іс — шаралар; бұл мерекелер, ойын-сауық, ҰБТ жобалары және тағы басқалар."

	// footer
	getItems("footer_about_as").innerHTML = "біз туралы"
	getItems("footer_gos_trasiteons").innerHTML = "Мемлекеттік қызметтер"
	getItems("footer_gos_pay").innerHTML = "Мемлекеттік сатып алу"
	getItems("footer_news").innerHTML = "Жаңалықтар";

	getItems("footer_contact_tell").innerHTML = "байланыс";


	// about_us


	//goZakaz
	 
	getItems("gos_zakas_site").innerHTML = "МЕМЛЕКЕТТІК ҚЫЗМЕТТЕР"
	getItems("gos_title_1").innerHTML = "Петропавл қаласында 'INDIGO: электрондық балабақша' порталында мемлекеттік балабақшаларға арналған 'электрондық шарттар'' модулі іске қосылды. Шарт оқуға түсуге жолдама алғаннан кейін ғана жасалады және мектепке дейінгі ұйымға қабылдау бойынша Мемлекеттік қызмет көрсету процесінің бөлігі болып табылады. Электрондық шарт жасасу үшін ата-аналардың ЭЦҚ болуы және келесі алгоритмді ұстануы қажет:"

	getItems("gos_title_2").innerHTML = "ӨТЕ МАҢЫЗДЫ:"
	getItems("gos_title_3").innerHTML = "ЭЦҚ-электрондық шарттарға қол қоюдың басты құралы. ЭЦҚ-ны ХҚКО-ға немесе үйден қашықтықтан портал арқылы алуға болады egov.kz.ЭЦҚ алу туралы алдын ала қамқорлық жасаңыз. Әсіресе ЭЦҚ алғаш рет қолданатын ата-аналарға қатысты. ЭЦҚ қолданылу мерзімі әдепкі бойынша 1 жыл. Болашақта жарамдылық мерзімін ұзартуға болады egov.kz."

	getItems("gos_title_4").innerHTML = "назар аударыңыз!"
	getItems("gos_title_5").innerHTML = "Әдетте, жаңа ЭЦҚ берілгеннен кейін оның қолданылу күні ЭЦҚ ішінде жазылады және келесі күні белгіленеді. Сондықтан тағы да: мұндай операцияларды алдын-ала жасау керек. ақыры тағы да! Ешқашан және ешкімге Жеке кабинеттен тіркелгі деректерін бермеңіз. ЭЦҚ өте маңызды. Сонымен қатар, балабақшаға қабылдау кезінде ешкім сіздің ЭЦҚ-ны талап етуге құқылы емес. Балабақшамен қолма-қол ақшасыз қаржылық операцияларды жүргізу үшін банктік шот қажет. Тек балабақшаға төлемдер ғана емес. Бірақ кері. Балабақша ата-анасына ақша аударатын жағдайлар аз емес, әсіресе өзара есеп айырысу кезінде. Кімнің банктік шоты жоқ-сізге ашу керек. Онсыз келісімшартқа қол қойылмайды. Фотосуретті таңдауға жауапкершілікпен қараңыз. Оны төлқұжат ретінде жасаудың қажеті жоқ-қайғылы және сұр бетпен. Бірақ барлық достарыңызбен, туыстарыңызбен және ойыншықтарыңызбен суретке түсірудің қажеті жоқ. Әдемі, жуылған, киінген бала-беті мен иығы жақыннан. Күлімсіреу міндетті! "



	// gos__list
	getItems("gos_list_1").innerHTML = "INDIGO жеке кабинетіне кіріп, 'менің бағыттарым'' бөліміндегі 'шарт жасасу'' батырмасын басыңыз (батырманы басқаннан кейін жүйе арнайы процесті бастайды және қажетті ақпаратты жинай отырып, ата-ананы кезең-кезеңімен басқарады).";
	getItems("gos_list_2").innerHTML = "Деректемелеріңізді 'шарт жасасу'' бөліміне енгізіңіз."
	getItems("gos_list_3").innerHTML = "Шарттың анықтамасымен және оны жасау үшін қажетті құжаттардың тізілімімен танысып келесі қадамға өту керек"
	getItems("gos_list_4").innerHTML = "2-ші қадамда ЭЦҚ-ны тіркеп, оның паролін көрсету қажет."
	getItems("gos_list_5").innerHTML = "Егер шарттар — Менің деректемелерім бөлімінде сіз барлық деректерді толтырған болсаңыз, онда осы №3 қадамда осы деректердің барлығы автоматты түрде тартылады. Егер деректер толтырылмаған болса, онда деректемелерді жүргізу қажет"
	getItems("gos_list_6").innerHTML = "4-ші қадамда деректемелердің дұрыстығына көз жеткізу керек"
	getItems("gos_list_7").innerHTML = "5-ші қадамда баланың фотосуреті мен қажетті құжаттарды тіркеу қажет (бекітілген құжат 1 Мб-тан аспауы керек.)"
	getItems("gos_list_8").innerHTML = "6-қадамда шартқа қол қою үшін ЭЦҚ-ны тіркеп, онымен алдын ала танысу қажет."
}


function getItems(items){
	let elem  = document.querySelector("#"+items);
	return elem;
}

