document.addEventListener("click",(event)=>{
	if(event.target.classList.contains("buttons_link_russ")){

		myFuncRuss();
	}
	if(event.target.classList.contains("buttons_link_kaz")){

		myFuncKazz();
	}

})



function myFuncRuss(event){

	// header
	getItems("about_as_trasiteons").innerHTML ="О&nbsp;нас "
	getItems("gos_trasiteons").innerHTML = "Государственные услуги"
	getItems("about_pay_trasiteons").innerHTML = "Государственные закупки"
	getItems("news_trasiteons").innerHTML = "Новости"

	// logo center title
	
	getItems("logo_center_title").innerHTML = "ДЕТСКИЙ САДИК БАЛДАУРЕН"

	// about sadic
	getItems("about_sadik").innerHTML = "О ЧАСТНОМ ДЕТСКОМ САДЕ"
	getItems("about_sadik-text").innerHTML = "Наш детский сад — это островок детства; где интересные и увлекательные занятия, которые проводят с детьми наши воспитатели; это праздники, развлечения, проекты… и многое — многое другое, которое надо только увидеть, чтобы оценить! Педагогический коллектив детского сада избрал своим девизом слова великого педагога В.А. Сухомлинского: «Детство — важнейший период человеческой жизни, не подготовка к будущей жизни, а настоящая, яркая, самобытная, неповторимая жизнь. И того, как прошло детство, кто вёл ребёнка за руку в детские годы, что вошло в его разум и сердце из окружающего мира, — от этого в решающей степени зависит, каким человеком станет сегодняшний малыш»."

	getItems("how_we_work").innerHTML = "КАК МЫ РАБОТАЕМ!"
	getItems("how_we_work_title_1").innerHTML = "Разнообразная деятельность"
	getItems("how_we_work_title_1-text").innerHTML = "Все занятия проходят в игровой форме, но это не просто игра, а игра, направленная на обучение. В нашем детском саду проводятся занятия по музыке и хореографии, изобразительному искусству и народным промыслам, есть собственная театральная мастерская."
	
	getItems("how_we_work_title_2").innerHTML = "ребята знакомятся с миром букв"
	getItems("how_we_work_title_2-text").innerHTML = "Малыши начинают изучать испанский и английский языки с опытным преподавателем. Иностранные языки преподносятся в легкой и доступной форме. Вашего малыша не будут загружать домашними заданиями. Изучение с ранних лет иностранных языков поможет Вашему ребенку понять основы языка и потом с легкостью изучать его в школе."
    
    getItems("how_we_work_title_3").innerHTML = "Мы даём ребёнку возможность развиваться"
	getItems("how_we_work_title_3-text").innerHTML = "В нашем детском саду основное внимание уделяется созданию особой развивающей среды, стимулирующей все процессы развития ребёнка. Главная задача наших воспитателей и педагогов — поддерживать чувство заинтересованности к познанию нового, направлять и увлекать в процесс обучения."

	getItems("our_galary").innerHTML = "Наши фотографии"


	getItems("footer_contact_about").innerHTML = "О&nbsp;нас "
	getItems("footer_contact_about-text").innerHTML = "Наш детский сад — это островок детства; где интересные и увлекательные занятия, которые проводят с детьми наши воспитатели; это праздники, развлечения, проекты… и многое — многое другое."

	// footer	
	getItems("footer_about_as").innerHTML ="О&nbsp;нас "
	getItems("footer_gos_trasiteons").innerHTML = "Государственные услуги"
	getItems("footer_gos_pay").innerHTML = "Государственные закупки"
	getItems("footer_news").innerHTML = "Новости"

	getItems("footer_contact_tell").innerHTML = "контакты"



	// about_as	

	getItems("about_us_site").innerHTML = "О нас"
	getItems("about_us_site-text").innerHTML = "Наш детский сад — это островок детства; где интересные и увлекательные занятия, которые проводят с детьми наши воспитатели; это праздники, развлечения, проекты… и многое — многое другое, которое надо только увидеть, чтобы оценить! Педагогический коллектив детского сада избрал своим девизом слова великого педагога В.А. Сухомлинского: «Детство — важнейший период человеческой жизни, не подготовка к будущей жизни, а настоящая, яркая, самобытная, неповторимая жизнь. И того, как прошло детство, кто вёл ребёнка за руку в детские годы, что вошло в его разум и сердце из окружающего мира, — от этого в решающей степени зависит, каким человеком станет сегодняшний малыш»."





}

function myFuncKazz(event){

	// header
	getItems("about_as_trasiteons").innerHTML = "біз туралы"
	getItems("gos_trasiteons").innerHTML = "Мемлекеттік қызметтер"
	getItems("about_pay_trasiteons").innerHTML = "Мемлекеттік сатып алу"
	getItems("news_trasiteons").innerHTML = "Жаңалықтар";

	// logo center title
	getItems("logo_center_title").innerHTML = "БАЛДӘУРЕН БАЛАБАҚШАСЫ"

	// about sadic
	getItems("about_sadik").innerHTML = "ЖЕКЕ БАЛАБАҚША ТУРАЛЫ"

	getItems("about_sadik-text").innerHTML = "ЖБіздің балабақша-бұл балалық шақтың аралы; мұнда біздің тәрбиешілер балалармен өткізетін қызықты және қызықты іс — шаралар; бұл мерекелер, ойын-сауық, ҰБТ жобалары және тағы басқалар, оны бағалау үшін көру керек! Балабақшаның педагогикалық ұжымы өзінің ұранымен Ұлы педагог В. А. Сухомлинскийдің сөздерін таңдады: балалық шақ — адам өмірінің маңызды кезеңі, болашақ өмірге дайындық емес, шынайы, жарқын, ерекше, ерекше өмір. Балалық шақтың қалай өткені, баланың балалық шағында қолын кім басқарғаны, оның ақыл — ойы мен жүрегіне қоршаған әлемнен не кіргені-бүгінгі баланың қандай адам болатыны шешуші дәрежеде байланысты"
	getItems("how_we_work").innerHTML = "БІЗ ҚАЛАЙ ЖҰМЫС ІСТЕЙМІЗ!"
	getItems("how_we_work_title_1").innerHTML = "Әр түрлі іс-шаралар"
	getItems("how_we_work_title_1-text").innerHTML = "Барлық сабақтар ойын түрінде өтеді, бірақ бұл жай ойын емес, оқуға бағытталған ойын. Біздің балабақшада музыка және хореография, бейнелеу өнері және халық қолөнері бойынша сабақтар өткізіледі, өз театр шеберханасы бар."
	
	getItems("how_we_work_title_2").innerHTML = "балалар әріптер әлемімен танысады"
	getItems("how_we_work_title_2-text").innerHTML = "Балалар тәжірибелі оқытушымен испан және ағылшын тілдерін үйрене бастайды. Шет тілдері жеңіл және қол жетімді түрде ұсынылады. Сіздің балаңыз үй тапсырмасын жүктемейді. Ерте жастан бастап шет тілдерін үйрену сіздің балаңызға тілдің негіздерін түсінуге, содан кейін оны мектепте оңай үйренуге көмектеседі."

	getItems("how_we_work_title_3").innerHTML = "Біз балаға дамуға мүмкіндік береміз"
	getItems("how_we_work_title_3-text").innerHTML = "Біздің балабақшада баланың дамуының барлық процестерін ынталандыратын ерекше даму ортасын құруға баса назар аударылады. Біздің тәрбиешілер мен мұғалімдердің басты міндеті-жаңа нәрселерді білуге деген қызығушылық сезімін сақтау, оқу процесіне бағыттау және тарту."
	
	getItems("our_galary").innerHTML = "Біздің фотосуреттер"

	getItems("footer_contact_about").innerHTML = "біз туралы"
	getItems("footer_contact_about-text").innerHTML = "Біздің балабақша-бұл балалық шақтың аралы; мұнда біздің тәрбиешілер балалармен өткізетін қызықты және қызықты іс — шаралар; бұл мерекелер, ойын-сауық, ҰБТ жобалары және тағы басқалар."

	// footer
	getItems("footer_about_as").innerHTML = "біз туралы"
	getItems("footer_gos_trasiteons").innerHTML = "Мемлекеттік қызметтер"
	getItems("footer_gos_pay").innerHTML = "Мемлекеттік сатып алу"
	getItems("footer_news").innerHTML = "Жаңалықтар";

	getItems("footer_contact_tell").innerHTML = "байланыс";


	// about_us

	getItems("about_us_site").innerHTML = "біз туралы"
	getItems("about_us_site-text").innerHTML = "ЖБіздің балабақша-бұл балалық шақтың аралы; мұнда біздің тәрбиешілер балалармен өткізетін қызықты және қызықты іс — шаралар; бұл мерекелер, ойын-сауық, ҰБТ жобалары және тағы басқалар, оны бағалау үшін көру керек! Балабақшаның педагогикалық ұжымы өзінің ұранымен Ұлы педагог В. А. Сухомлинскийдің сөздерін таңдады: балалық шақ — адам өмірінің маңызды кезеңі, болашақ өмірге дайындық емес, шынайы, жарқын, ерекше, ерекше өмір. Балалық шақтың қалай өткені, баланың балалық шағында қолын кім басқарғаны, оның ақыл — ойы мен жүрегіне қоршаған әлемнен не кіргені-бүгінгі баланың қандай адам болатыны шешуші дәрежеде байланысты"



}


function getItems(items){
	let elem  = document.querySelector("#"+items);
	return elem;
}

